n5/src/Documents/TenantOrder/TenantOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantOrder</name>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>AccessPrice</name>
    <type>
      <types>DefinedType.Price</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BonusPercent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>MonthsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCodeDiscount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>UsersCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/TenantPayment/TenantPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantPayment</name>
  <registerRecords>AccumulationRegister.Agents</registerRecords>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>TenantOrder</name>
    <type>
      <types>DocumentRef.TenantOrder</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/TenantOrder/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setListDataParameters ();
	setLicenseInformation ();
	setUsersInformation ();
	
EndProcedure

&AtServer
Procedure setListDataParameters ()
	
	List.Parameters.SetParameterValue ( "Today", BegOfDay ( CurrentSessionDate () ) );
	
EndProcedure 

&AtServer
Procedure setLicenseInformation ()
	
	info = getEndOfLicense ();
	if ( info = undefined ) then
		return;
	endif;
	p = new Structure ( "DaysRemain", Info.DaysRemain );
	if ( info.TrialPeriod ) then
		Items.LicenseProgress.Title = Output.TrialPeriodInformation ( p );
	else
		Items.LicenseProgress.Title = Output.LicensePeriodInformation ( p );
	endif; 
	Items.LicenseProgress.MaxValue = info.LicensePeriod;
	LicenseProgress = info.LicensePeriod - info.DaysRemain;
	
EndProcedure 

&AtServer
Function getEndOfLicense ()
	
	s = "
	|select allowed top 1 datediff ( &Today, Licenses.Date, day ) as DaysRemain, Licenses.TrialPeriod as TrialPeriod,
	|	Licenses.LicensePeriod as LicensePeriod
	|from (	select Tenants.EndOfTrialPeriod as Date, true as TrialPeriod, Constants.TrialPeriod as LicensePeriod
	|		from Catalog.Tenants as Tenants
	|			//
	|			// Constants
	|			//
	|			join Constants as Constants
	|			on true
	|		where Tenants.Ref = &Tenant
	|		and &Today <= Tenants.EndOfTrialPeriod
	|		union
	|		select min ( TenantOrders.DateEnd ), false, min ( datediff ( TenantOrders.Date, TenantOrders.DateEnd, day ) )
	|		from Document.TenantOrder as TenantOrders
	|			//
	|			// TenantPayments
	|			//
	|			join Document.TenantPayment as TenantPayments
	|			on TenantPayments.TenantOrder = TenantOrders.Ref
	|			and TenantPayments.Posted
	|		where &Today between TenantOrders.Date and TenantOrders.DateEnd ) as Licenses
	|where Licenses.Date is not null
	|order by Licenses.Date desc
	|";
	q = new Query ( s );
	q.SetParameter ( "Today", BegOfDay ( CurrentSessionDate () ) );
	q.SetParameter ( "Tenant", SessionParameters.Tenant );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ] );
	
EndFunction 

&AtServer
Procedure setUsersInformation ()
	
	info = CloudPayments.GetInfo ();
	UsersCount = info.UsersCount;
	PaidUsersCount = info.PaidUsersCount;
	
EndProcedure
